app/Models/InstansiModel.php

SELECT *
FROM `instansi`
---
    public function get_instansi()
    {
        return $this->db->table('instansi')->get()->getResultArray();