app/Models/JadwalModel.php

SELECT *
FROM `jadwal`
---
    public function get_jadwal()
    {
        return $this->db->table('jadwal')->get()->getResultArray();

INSERT INTO `jadwal` (`tgl_jadwal`, `ket_jadwal`) VALUES ('06-06-2002', 'ulang tahun')
---
    public function  insert_jadwal($data)
    {
        return $this->db->table('jadwal')->insert($data);

DELETE FROM `jadwal`
WHERE `id_jadwal` = '1'
---
    public function  delete_jadwal($id_jadwal)
    {
        return $this->db->table('jadwal')->delete(array('id_jadwal'=> $id_jadwal));