app/Models/ProductModel.php

SELECT *
FROM `product`
---
    function get_product()
    {
        return $this->db->table('product')->get()->getResultArray();

SELECT *
FROM `product`
WHERE `product_id` = '11'
---
    public function edit_product($product_id)
    {
        return $this->db->table('product')->where('product_id',$product_id)->get()->getRowArray();